ERP DEV.КонтурМаркировка/src/Catalogs/КонтурМаркировка_Файлы/КонтурМаркировка_Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурМаркировка_Файлы</name>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>CatalogRef.КонтурМаркировка_Склады</types>
      <types>CatalogRef.КонтурМаркировка_ШаблоныЭтикеток</types>
      <types>CatalogRef.КонтурМаркировка_РазрешительныеДокументы</types>
      <types>CatalogRef.КонтурМаркировка_ДокументыУчета</types>
      <types>CatalogRef.КонтурМаркировка_Товары</types>
      <types>CatalogRef.КонтурМаркировка_Файлы</types>
      <types>CatalogRef.КонтурМаркировка_МобильныеУстройства</types>
      <types>CatalogRef.КонтурМаркировка_Контрагенты</types>
      <types>CatalogRef.КонтурМаркировка_Сертификаты</types>
      <types>CatalogRef.КонтурМаркировка_Операции</types>
      <types>CatalogRef.КонтурМаркировка_Пользователи</types>
      <types>CatalogRef.КонтурМаркировка_ДопСправочники</types>
      <types>CatalogRef.КонтурМаркировка_Организации</types>
      <types>CatalogRef.КонтурМаркировка_КлючиНоменклатуры1С</types>
      <types>CatalogRef.КонтурМаркировка_СервисПровайдеры</types>
      <types>CatalogRef.КонтурМаркировка_ВидыАгрегатов</types>
      <types>CatalogRef.КонтурМаркировка_Площадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.КонтурМаркировка_Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияФормата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.КонтурМаркировка/src/Catalogs/КонтурМаркировка_Файлы/ManagerModule.bsl
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("ТипФайла");
	Поля.Добавить("ИмяФайла");
	Поля.Добавить("Идентификатор");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Данные.ИмяФайла) Тогда
		Представление = Данные.ИмяФайла;
	ИначеЕсли ЗначениеЗаполнено(Данные.Идентификатор) Тогда
		Представление = Данные.ТипФайла + " (" + Данные.Идентификатор + ")";
	Иначе
		Представление = Данные.ТипФайла;
	КонецЕсли;
	
КонецПроцедуры
